/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Phonebook.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: skelly <skelly@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/18 09:03:41 by skelly            #+#    #+#             */
/*   Updated: 2022/01/18 09:03:42 by skelly           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "phonebook.hpp"

Phonebook::Phonebook()
{
	//инициализирую записываю в поле size 0
	this->size = 0;
	return ;
}

Phonebook::~Phonebook()
{
	//ничего не делаю тк не выделяю память
	return ;
}
//метод добавление контакта
void	Phonebook::add_contact(Contact new_contact)
{
	int	i;

	i = 0;
	while(i < this->size)// 1 доступный индекс в зав-ти от текущего размсера
		i++;
	if(i == 8) //если 8 и переполнение
	{
		i = 0;
		while (i < 8 - 1)
		{
			//контакт с 0 индексом перезаписываю следующим эл-том
			//сдвигаю все наверх, и старая 0 запись удаляется
			this->array[i] = this->array[i + 1];
			i++;
		}
		//уменьшаю на 1 тк ниже добавться 1
		this->size -= 1;
	}
	//если не равен 8 то добавляю контакт в этот индекс
	this->array[i] = new_contact; 
	//увеличиваю размер на 1
	this->size += 1;
}